cwmp/messages/Download.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:cwmp="urn:dslforum-org:cwmp-1-2">
 <SOAP-ENV:Header>
  <cwmp:HoldRequests SOAP-ENV:mustUnderstand=""></cwmp:HoldRequests>
  <cwmp:ID SOAP-ENV:mustUnderstand=""></cwmp:ID>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <cwmp:Download>
    <CommandKey></CommandKey>
    <FileType></FileType>
    <URL></URL>
    <Username></Username>
    <Password></Password>
    <FileSize>0</FileSize>
    <TargetFileName></TargetFileName>
    <DelaySeconds>0</DelaySeconds>
    <SuccessURL></SuccessURL>
    <FailureURL></FailureURL>
   </cwmp:Download>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
